In [1]:
import sqlite3
import pandas as pd

# 1. Connect to an in-memory database
# This creates a temporary database that exists only while the script runs
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

print("--- Database Setup and Data Insertion ---")

# 2. Setup Code (Create Table & Insert Data)
setup_sql = """
CREATE TABLE Employees (
    EmpID INTEGER PRIMARY KEY,
    EmpName VARCHAR(100),
    Department VARCHAR(50),
    City VARCHAR(50),
    Salary INTEGER,
    HireDate DATE
);

INSERT INTO Employees (EmpID, EmpName, Department, City, Salary, HireDate) VALUES
(101, 'Rahul Mehta', 'Sales', 'Delhi', 55000, '2020-04-12'),
(102, 'Priya Sharma', 'HR', 'Mumbai', 62000, '2019-09-25'),
(103, 'Aman Singh', 'IT', 'Bengaluru', 72000, '2021-03-10'),
(104, 'Neha Patel', 'Sales', 'Delhi', 48000, '2022-01-14'),
(105, 'Karan Joshi', 'Marketing', 'Pune', 45000, '2018-07-22'),
(106, 'Divya Nair', 'IT', 'Chennai', 81000, '2019-12-11'),
(107, 'Raj Kumar', 'HR', 'Delhi', 60000, '2020-05-28'),
(108, 'Simran Kaur', 'Finance', 'Mumbai', 58000, '2021-08-03'),
(109, 'Arjun Reddy', 'IT', 'Hyderabad', 70000, '2022-02-18'),
(110, 'Anjali Das', 'Sales', 'Kolkata', 51000, '2023-01-15');
"""
cursor.executescript(setup_sql)
print("Employees table created and data inserted successfully.\n")


# Helper function to run a query and print the results
def run_and_print_query(question_number, question_text, query):
    print(f"--- Question {question_number}: {question_text} ---")
    # pandas reads the SQL query result directly into a DataFrame
    df = pd.read_sql_query(query, conn)
    print(df.to_markdown(index=False)) # print as markdown table
    print("\n")


# 3. Execute all 8 Solution Queries

# Question 1: Show employees working in either the 'IT' or 'HR' departments.
run_and_print_query(
    1,
    "Employees in 'IT' or 'HR' departments.",
    "SELECT * FROM Employees WHERE Department IN ('IT', 'HR');"
)

# Question 2: Retrieve employees whose department is in 'Sales', 'IT', or 'Finance'.
run_and_print_query(
    2,
    "Employees in 'Sales', 'IT', or 'Finance' departments.",
    "SELECT * FROM Employees WHERE Department IN ('Sales', 'IT', 'Finance');"
)

# Question 3: Display employees whose salary is between ₹50,000 and ₹70,000.
run_and_print_query(
    3,
    "Salary between 50,000 and 70,000.",
    "SELECT * FROM Employees WHERE Salary BETWEEN 50000 AND 70000;"
)

# Question 4: List employees whose names start with the letter 'A'.
run_and_print_query(
    4,
    "Names starting with 'A'.",
    "SELECT * FROM Employees WHERE EmpName LIKE 'A%';"
)

# Question 5: Find employees whose names contain the substring 'an'.
run_and_print_query(
    5,
    "Names containing the substring 'an'.",
    "SELECT * FROM Employees WHERE EmpName LIKE '%an%';"
)

# Question 6: Show employees who are from 'Delhi' or 'Mumbai' and earn more than 55,000.
run_and_print_query(
    6,
    "From 'Delhi' or 'Mumbai' AND salary > 55,000.",
    "SELECT * FROM Employees WHERE (City = 'Delhi' OR City = 'Mumbai') AND Salary > 55000;"
)

# Question 7: Display all employees except those from the 'HR' department.
run_and_print_query(
    7,
    "All employees EXCEPT those from 'HR'.",
    "SELECT * FROM Employees WHERE Department NOT IN ('HR');"
)

# Question 8: Get all employees hired between 2019 and 2022, ordered by HireDate (oldest first).
run_and_print_query(
    8,
    "Hired between 2019 and 2022, ordered by HireDate.",
    """
    SELECT *
    FROM Employees
    WHERE HireDate BETWEEN '2019-01-01' AND '2022-12-31'
    ORDER BY HireDate ASC;
    """
)

# Close the connection (clears the in-memory database)
conn.close()

--- Database Setup and Data Insertion ---
Employees table created and data inserted successfully.

--- Question 1: Employees in 'IT' or 'HR' departments. ---
|   EmpID | EmpName      | Department   | City      |   Salary | HireDate   |
|--------:|:-------------|:-------------|:----------|---------:|:-----------|
|     102 | Priya Sharma | HR           | Mumbai    |    62000 | 2019-09-25 |
|     103 | Aman Singh   | IT           | Bengaluru |    72000 | 2021-03-10 |
|     106 | Divya Nair   | IT           | Chennai   |    81000 | 2019-12-11 |
|     107 | Raj Kumar    | HR           | Delhi     |    60000 | 2020-05-28 |
|     109 | Arjun Reddy  | IT           | Hyderabad |    70000 | 2022-02-18 |


--- Question 2: Employees in 'Sales', 'IT', or 'Finance' departments. ---
|   EmpID | EmpName     | Department   | City      |   Salary | HireDate   |
|--------:|:------------|:-------------|:----------|---------:|:-----------|
|     101 | Rahul Mehta | Sales        | Delhi     |    55000 | 2020-04-12 |
|     103 | Aman Singh  | IT           | Bengaluru |    72000 | 2021-03-10 |
|     104 | Neha Patel  | Sales        | Delhi     |    48000 | 2022-01-14 |
|     106 | Divya Nair  | IT           | Chennai   |    81000 | 2019-12-11 |
|     108 | Simran Kaur | Finance      | Mumbai    |    58000 | 2021-08-03 |
|     109 | Arjun Reddy | IT           | Hyderabad |    70000 | 2022-02-18 |
|     110 | Anjali Das  | Sales        | Kolkata   |    51000 | 2023-01-15 |


--- Question 3: Salary between 50,000 and 70,000. ---
|   EmpID | EmpName      | Department   | City      |   Salary | HireDate   |
|--------:|:-------------|:-------------|:----------|---------:|:-----------|
|     101 | Rahul Mehta  | Sales        | Delhi     |    55000 | 2020-04-12 |
|     102 | Priya Sharma | HR           | Mumbai    |    62000 | 2019-09-25 |
|     107 | Raj Kumar    | HR           | Delhi     |    60000 | 2020-05-28 |
|     108 | Simran Kaur  | Finance      | Mumbai    |    58000 | 2021-08-03 |
|     109 | Arjun Reddy  | IT           | Hyderabad |    70000 | 2022-02-18 |
|     110 | Anjali Das   | Sales        | Kolkata   |    51000 | 2023-01-15 |


--- Question 4: Names starting with 'A'. ---
|   EmpID | EmpName     | Department   | City      |   Salary | HireDate   |
|--------:|:------------|:-------------|:----------|---------:|:-----------|
|     103 | Aman Singh  | IT           | Bengaluru |    72000 | 2021-03-10 |
|     109 | Arjun Reddy | IT           | Hyderabad |    70000 | 2022-02-18 |
|     110 | Anjali Das  | Sales        | Kolkata   |    51000 | 2023-01-15 |


--- Question 5: Names containing the substring 'an'. ---
|   EmpID | EmpName     | Department   | City      |   Salary | HireDate   |
|--------:|:------------|:-------------|:----------|---------:|:-----------|
|     103 | Aman Singh  | IT           | Bengaluru |    72000 | 2021-03-10 |
|     105 | Karan Joshi | Marketing    | Pune      |    45000 | 2018-07-22 |
|     108 | Simran Kaur | Finance      | Mumbai    |    58000 | 2021-08-03 |
|     110 | Anjali Das  | Sales        | Kolkata   |    51000 | 2023-01-15 |


--- Question 6: From 'Delhi' or 'Mumbai' AND salary > 55,000. ---
|   EmpID | EmpName      | Department   | City   |   Salary | HireDate   |
|--------:|:-------------|:-------------|:-------|---------:|:-----------|
|     102 | Priya Sharma | HR           | Mumbai |    62000 | 2019-09-25 |
|     107 | Raj Kumar    | HR           | Delhi  |    60000 | 2020-05-28 |
|     108 | Simran Kaur  | Finance      | Mumbai |    58000 | 2021-08-03 |


--- Question 7: All employees EXCEPT those from 'HR'. ---
|   EmpID | EmpName     | Department   | City      |   Salary | HireDate   |
|--------:|:------------|:-------------|:----------|---------:|:-----------|
|     101 | Rahul Mehta | Sales        | Delhi     |    55000 | 2020-04-12 |
|     103 | Aman Singh  | IT           | Bengaluru |    72000 | 2021-03-10 |
|     104 | Neha Patel  | Sales        | Delhi     |    48000 | 2022-01-14 |
|     105 | Karan Joshi | Marketing    | Pune      |    45000 | 2018-07-22 |
|     106 | Divya Nair  | IT           | Chennai   |    81000 | 2019-12-11 |
|     108 | Simran Kaur | Finance      | Mumbai    |    58000 | 2021-08-03 |
|     109 | Arjun Reddy | IT           | Hyderabad |    70000 | 2022-02-18 |
|     110 | Anjali Das  | Sales        | Kolkata   |    51000 | 2023-01-15 |


--- Question 8: Hired between 2019 and 2022, ordered by HireDate. ---
|   EmpID | EmpName      | Department   | City      |   Salary | HireDate   |
|--------:|:-------------|:-------------|:----------|---------:|:-----------|
|     102 | Priya Sharma | HR           | Mumbai    |    62000 | 2019-09-25 |
|     106 | Divya Nair   | IT           | Chennai   |    81000 | 2019-12-11 |
|     101 | Rahul Mehta  | Sales        | Delhi     |    55000 | 2020-04-12 |
|     107 | Raj Kumar    | HR           | Delhi     |    60000 | 2020-05-28 |
|     103 | Aman Singh   | IT           | Bengaluru |    72000 | 2021-03-10 |
|     108 | Simran Kaur  | Finance      | Mumbai    |    58000 | 2021-08-03 |
|     104 | Neha Patel   | Sales        | Delhi     |    48000 | 2022-01-14 |
|     109 | Arjun Reddy  | IT           | Hyderabad |    70000 | 2022-02-18 |